Tekla.Structures.ModelInternal.InputGeometry
The input geometry class is used for creating a direct modification object for a tool.
It has to be connected to eventhandler which listens geometry changes from the user.
The following example shows how to create a slab and modify it's geometry based on direct modification object changes.
Events are unregistered when user selects something in the model
using Tekla.Structures.Geometry3d;
using Tekla.Structures.Model;
using Tekla.Structures.Model.UI;
public class Example
{
private Model model = new Model();
private InputGeometryEvents uiEvents = new InputGeometryEvents();
private Tekla.Structures.Model.Events events = new Tekla.Structures.Model.Events();
private object selectionEventHandlerLock = new object();
private object changedObjectHandlerLock = new object();
private ContourPlate cp = new ContourPlate();
private InputGeometry input = null;
public void Example1()
{
uiEvents.PointInputChanged += Events_InputObjectChangedEvent;
uiEvents.Register();
events.SelectionChange += Events_SelectionChangeEvent;
events.Register();
cp.AddContourPoint(new ContourPoint(new Point( 3000,  6000, 0),null));
cp.AddContourPoint(new ContourPoint(new Point( 6000,  6000, 0),null));
cp.AddContourPoint(new ContourPoint(new Point( 6000, 12000, 0),null));
cp.AddContourPoint(new ContourPoint(new Point( 3000, 12000, 0),null));
if (!cp.Insert())
Console.WriteLine("ContourPlate Insert failed!");
else
{
model.CommitChanges();
Polygon polygon = new Polygon();
foreach (ContourPoint p in cp.Contour.ContourPoints)
polygon.Points.Add(new TSG.Point(p.X, p.Y, p.Z));
input = new InputGeometry(polygon, uiEvents);
input.DrawObject("testing..");
}
}
public void UnRegisterEventHandler()
{
uiEvents.UnRegister();
events.UnRegister();
}
void Events_InputObjectChangedEvent(List<ContourPoint> changes)
{
/* Make sure that the inner code block is running synchronously */
lock (changedObjectHandlerLock)
{
if (cp != null)
{
cp.Contour.ContourPoints.Clear();
foreach (ContourPoint point in points)
cp.AddContourPoint(point);
cp.Modify();
model.CommitChanges();
}
}
}
void Events_SelectionChangeEvent()
{
/* Make sure that the inner code block is running synchronously */
lock(_selectionEventHandlerLock)
{
if(input != null)
input.RemoveObject();
System.Console.WriteLine("Selection changed event received.");
uiEvents.UnRegister();
events.UnRegister();
}
}
}

Tekla.Structures.ModelInternal.InputGeometry.#ctor(Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.ModelInternal.IInputGeometryEvents)
Creates a new InputGeometry instance for line.
line: The line to be used in input object.
events: The attached event listener.

Tekla.Structures.ModelInternal.InputGeometry.#ctor(Tekla.Structures.Model.Polygon,Tekla.Structures.ModelInternal.IInputGeometryEvents)
Creates a new InputGeometry instance for polygon.
polygon: The polygon to be used in input object.
events: The attached event listener.

Tekla.Structures.ModelInternal.InputGeometry.#ctor(Tekla.Structures.Geometry3d.PolyLine,Tekla.Structures.ModelInternal.IInputGeometryEvents)
Creates a new InputGeometry instance for polyline.
polyLine: The polyline to be used in input object.
events: The attached event listener.

Tekla.Structures.ModelInternal.InputGeometry.#ctor(System.Collections.Generic.List{Tekla.Structures.Model.ContourPoint},Tekla.Structures.ModelInternal.IInputGeometryEvents,System.Boolean)
Creates a new InputGeometry instance for polyline.
contour: The contour points to be used in input object.
events: The attached event listener.
closed: Optional parameter to define if polyLine is closed or not (== default).

Tekla.Structures.ModelInternal.InputGeometry.DrawObject(System.String)
Draws created input geometry to view. Changes are sent to attached event listener
prompt: The display prompt.
Returns: True on success.

Tekla.Structures.ModelInternal.InputGeometry.RemoveObject(System.String)
Stops listening of events and destroys object from the view
prompt: The display prompt.
Returns: True on success.